khoih-prog/ESP_AT_WM_Lite/src/Esp8266_AT_WM_Lite.h
        strcpy(ESP8266_AT_config.header, ESP_AT_BOARD_TYPE);
        
        for (int i = 0; i < NUM_MENU_ITEMS; i++)
        {
          DEBUG_WM4(F("g:myMenuItems["), i, F("]="), myMenuItems[i].pdata );
        }
        
        // Don't need
        ESP8266_AT_config.checkSum = 0;

        saveConfigData();
        
        return false;  
      }
      else if ( !strncmp(ESP8266_AT_config.wifi_ssid,       WM_NO_CONFIG, strlen(WM_NO_CONFIG) )  ||
                !strncmp(ESP8266_AT_config.wifi_pw,         WM_NO_CONFIG, strlen(WM_NO_CONFIG) )  ||
                !strlen(ESP8266_AT_config.wifi_ssid) || 
                !strlen(ESP8266_AT_config.wifi_pw)  )
      {
        // If SSID, PW ="nothing", stay in config mode forever until having config Data.
        return false;
      }
      else
      {
        displayConfigData(ESP8266_AT_config);
      }

      return true;
    }

    void saveConfigData()
    {
      int calChecksum = calcChecksum();
      ESP8266_AT_config.checkSum = calChecksum;
      
      DEBUG_WM6(F("SaveEEPROM,sz="), EEPROM.length(), F(",Datasz="), totalDataSize, F(",CSum="), calChecksum);

      //EEPROM_put();
      EEPROM.put(CONFIG_EEPROM_START, ESP8266_AT_config);
      EEPROM_putDynamicData();
    }

#if 1

// New connection logic for ESP32-AT from v1.0.6
    bool connectToWifi(int retry_time)
    {
      int sleep_time  = 250;
      uint8_t status;
                       
      DEBUG_WM1(F("Con2Wifi"));

      if (static_IP != IPAddress(0, 0, 0, 0))
      {
        DEBUG_WM1(F("UseStatIP"));
        WiFi.config(static_IP);
      }
         
      DEBUG_WM4(F("con2WF:SSID="), ESP8266_AT_config.wifi_ssid, F(",PW="), ESP8266_AT_config.wifi_pw);
             
      while ( !wifi_connected && ( 0 < retry_time ) )
      {      
        DEBUG_WM2(F("Remaining retry_time="), retry_time);
        
        status = WiFi.begin(ESP8266_AT_config.wifi_ssid, ESP8266_AT_config.wifi_pw); 
            
        // Need restart WiFi at beginning of each cycle 
        if (status == WL_CONNECTED)
        {
          wifi_connected = true;                   
          break;
        }
        else
        {
          delay(sleep_time);
          retry_time--;
        }         
      }
          
      if (retry_time <= 0)
      {      
        DEBUG_WM2(F("Con2WF:Failed, retry_time="), retry_time);             
      }  

      if (wifi_connected)
      {
        DEBUG_WM1(F("con2WF:OK"));
        displayWiFiData();
      }
      else
      {
        DEBUG_WM1(F("con2WF:failed"));  
        // Can't connect, so try another index next time. Faking this index is OK and lost
      }

      return wifi_connected;  
    }
    
#else

    bool connectToWifi(int timeout)
    {
      int sleep_time = 250;
      unsigned long currMillis = millis();

      DEBUG_WM1(F("con2WF:start"));

      if (static_IP != IPAddress(0, 0, 0, 0))
      {
        DEBUG_WM1(F("UseStatIP"));
        WiFi.config(static_IP);
      }

      while ( !wifi_connected && ( 0 < timeout ) && ( (millis() - currMillis) < (unsigned long) timeout )  )
      {
        DEBUG_WM2(F("con2WF:spentMsec="), millis() - currMillis);

        if (connectWiFi(ESP8266_AT_config.wifi_ssid, ESP8266_AT_config.wifi_pw))
        {
          wifi_connected = true;
        }
        else
        {
          delay(sleep_time);
          timeout -= sleep_time;
        }
      }

      if (wifi_connected)
      {
        DEBUG_WM1(F("con2WF:OK"));
        displayWiFiData();
      }
      else
      {
        DEBUG_WM1(F("con2WF:failed"));
      }

      return wifi_connected;
    }
#endif
      
    void createHTML(String& root_html_template)
    {   
      // -- HTML page fragments
      root_html_template= "<!DOCTYPE html><html><head><title>AVR_WM_Lite</title><style>div,input{padding:5px;font-size:1em;}input{width:95%;}body{text-align: center;}button{background-color:#16A1E7;color:#fff;line-height:2.4rem;font-size:1.2rem;width:100%;}fieldset{border-radius:0.3rem;margin:0px;}</style></head><div style=\"text-align:left;display:inline-block;min-width:260px;\"><fieldset><div><label>SSID</label><input value=\"[[id]]\"id=\"id\"><div></div></div><div><label>PWD</label><input value=\"[[pw]]\"id=\"pw\"><div></div></div></fieldset>";

      String ESP_AT_FLDSET_START = "<fieldset>";
      String ESP_AT_FLDSET_END     = "</fieldset>";
      String ESP_AT_HTML_PARAM    = "<div><label>{b}</label><input value='[[{v}]]'id='{i}'><div></div></div>";
      String ESP_AT_HTML_BUTTON    = "<button onclick=\"sv()\">Save</button></div>";
      String ESP_AT_HTML_SCRIPT    = "<script id=\"jsbin-javascript\">function udVal(key,val){var request=new XMLHttpRequest();var url='/?key='+key+'&value='+encodeURIComponent(val);request.open('GET',url,false);request.send(null);}\
      function sv(){udVal('id',document.getElementById('id').value);udVal('pw',document.getElementById('pw').value);";

      String ESP_AT_HTML_SCRIPT_ITEM   = "udVal('{d}',document.getElementById('{d}').value);";

      String ESP_AT_HTML_SCRIPT_END   = "alert('Updated');}</script>";

      String ESP_AT_HTML_END   = "</html>";
      ///

      String pitem;
      
      root_html_template += ESP_AT_FLDSET_START;
      
      for (int i = 0; i < NUM_MENU_ITEMS; i++)
      {
        pitem = ESP_AT_HTML_PARAM;
        pitem.replace("{b}", myMenuItems[i].displayName);
        pitem.replace("{v}", myMenuItems[i].id);
        pitem.replace("{i}", myMenuItems[i].id);
        
        root_html_template += pitem;
      }
      
      root_html_template += ESP_AT_FLDSET_END;
      root_html_template += ESP_AT_HTML_BUTTON;
      root_html_template += ESP_AT_HTML_SCRIPT;
      
      for (int i = 0; i < NUM_MENU_ITEMS; i++)
      {
        pitem = ESP_AT_HTML_SCRIPT_ITEM;
        
        pitem.replace("{d}", myMenuItems[i].id);
        
        root_html_template += pitem;
      }
      
      root_html_template += ESP_AT_HTML_SCRIPT_END;
      root_html_template += ESP_AT_HTML_END;
           
      return;     
    }

    void handleRequest()
    {
      if (server)
      {
        String key    = server->arg("key");
        String value  = server->arg("value");

        static int number_items_Updated = 0;

        if (key == "" && value == "")
        {
          String result;
          createHTML(result);
          
